<a href="https://colab.research.google.com/github/joohoshin/TensorflowAI/blob/main/5_1_%EC%A1%B0%EA%B1%B4_%EA%B2%80%EC%83%89.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 조건 검색
* pandas에서는 특정 조건을 만족하는 행만 쉽게 추출할 수 있습니다
* numpy로 간단한 데이터를 만들고 조건에 맞는 행을 선택해봅시다

In [1]:
import pandas as pd
import numpy as np

# numpy.random을 활용해서 가상의 성적을 만듭시다
n_student = 100

# 학생 아이디는 중복이 있으면 안됨, numpy는 choice를 사용해서 샘플링 가능, 
# 중복 없이 선택시는 replace=False 옵션 활용
student_id = np.random.choice(range(10000, 20000), n_student, replace = False)

In [2]:
student_id

array([12405, 14294, 12060, 10807, 14802, 11105, 11199, 14545, 16332,
       15724, 18921, 18083, 10460, 12338, 17836, 17064, 18242, 10885,
       18577, 19991, 19795, 14675, 12113, 18938, 18189, 16956, 18181,
       10499, 13932, 10252, 13387, 18072, 17729, 17297, 14333, 15980,
       18715, 10463, 19465, 16966, 16201, 15515, 16486, 11194, 10945,
       11082, 15414, 14714, 18201, 12685, 12230, 13373, 10994, 17400,
       15883, 10276, 16555, 13850, 13666, 18795, 16536, 16776, 15508,
       10381, 12176, 19074, 19347, 18361, 14565, 14667, 18858, 16339,
       19428, 16649, 13175, 14268, 16429, 14252, 16817, 13551, 10073,
       12889, 17940, 19710, 16910, 16473, 17807, 18238, 17051, 18979,
       18160, 19045, 12489, 11782, 16320, 13034, 13250, 18709, 17212,
       17195])

In [3]:
머신러닝 = np.random.choice(range(70, 101), n_student)
딥러닝 = np.random.choice(range(50, 101), n_student)
파이썬 = np.random.choice(range(40, 101), n_student)

In [4]:
# pandas dataframe으로 만들어봅시다
grade = pd.DataFrame({'id':student_id, '머신러닝':머신러닝, '딥러닝':딥러닝, '파이썬':파이썬})
grade

       id  머신러닝  딥러닝  파이썬
0   12405    86   75   87
1   14294    77   60   89
2   12060    76   53   61
3   10807    84   89   58
4   14802    76   56   44
..    ...   ...  ...  ...
95  13034    80   77   67
96  13250    99   85   56
97  18709    94   84   90
98  17212    81   93   79
99  17195    81  100   73

[100 rows x 4 columns]

In [5]:
grade =grade.set_index('id')

In [6]:
grade

       머신러닝  딥러닝  파이썬
id
12405    86   75   87
14294    77   60   89
12060    76   53   61
10807    84   89   58
14802    76   56   44
...     ...  ...  ...
13034    80   77   67
13250    99   85   56
18709    94   84   90
17212    81   93   79
17195    81  100   73

[100 rows x 3 columns]

* df.query()를 사용해서 특정 조건만 추출할 수 있습니다

In [7]:
머신러닝A = grade.query('머신러닝>=90')

In [8]:
머신러닝A

       머신러닝  딥러닝  파이썬
id
11105    97   65   81
14545    92   53   81
18083    90   54   85
10460    91   76   62
10885    92   66   46
19795    97   51   75
14675    92   90   55
17297    94   81   45
14333    96   85   93
19465    97   93   87
16201    93   73   63
16486    93   66   46
15414    91   75   87
18201    94   63   42
12685    95   63   51
12230    97   91   56
10994    93   61   94
15883    90   59   82
10276    95   51   53
18795    96   61   73
16536    93   94   79
10381    95   59   73
12176    91   55   93
19347    95   60   81
14565    96   96   40
16339    90   80   89
16649    94   87   53
14268    90   68   55
16429    90   71   87
16817    95   70   41
13551    93   91   89
17807    97   91   46
18160    94   88   85
13250    99   85   56
18709    94   84   90

In [9]:
print('머신러닝 A 학점 학생수: ',len(머신러닝A), '명')

머신러닝 A 학점 학생수:  35 명

* &, and 나 |, or를 사용해서 다양한 조건을 검색할 수 있습니다.

In [10]:
# 3과목 모두 80점 이상인 학생 추출
point = 80

#all = grade.query('머신러닝>=@point and 딥러닝 >=@point and 파이썬 >=@point')
all = grade.query('머신러닝>=@point & 딥러닝 >=@point & 파이썬 >=@point')
all

       머신러닝  딥러닝  파이썬
id
11199    87   91   83
14333    96   85   93
19465    97   93   87
16339    90   80   89
13551    93   91   89
17051    80   89   92
18160    94   88   85
19045    87   83   83
18709    94   84   90

In [11]:
# 3과목 중 1과목 이상 70점 미만인 학생 추출
point = 70

#all = grade.query('머신러닝 < @point or 딥러닝 < @point or 파이썬 < @point')
all = grade.query('머신러닝 < @point | 딥러닝 < @point | 파이썬 < @point')
all

       머신러닝  딥러닝  파이썬
id
14294    77   60   89
12060    76   53   61
10807    84   89   58
14802    76   56   44
11105    97   65   81
...     ...  ...  ...
18238    78   69   61
18979    84   55   71
12489    77   61   43
13034    80   77   67
13250    99   85   56

[71 rows x 3 columns]

# 연산하기



*   컬럼명을 바꿔봅시다
*   전체를 바꿀때는 df.columns = 컬럼명 리스트 (df는 dataframe 변수명을 넣습니다)
*   부분만 바꿀때는 df = df.rename(columns={'이전컬럼명':'새로운컬럼명',...} 바꾸고 싶은 컬럼이름을 딕셔너리로 넣어줍니다.

In [12]:
grade.columns

Index(['머신러닝', '딥러닝', '파이썬'], dtype='object')

In [13]:
grade.columns = ['퀴즈', '중간고사', '기말고사']

In [14]:
grade

       퀴즈  중간고사  기말고사
id
12405  86    75    87
14294  77    60    89
12060  76    53    61
10807  84    89    58
14802  76    56    44
...    ..   ...   ...
13034  80    77    67
13250  99    85    56
18709  94    84    90
17212  81    93    79
17195  81   100    73

[100 rows x 3 columns]

In [15]:
grade = grade.rename(columns = {'중간고사':'중간평가', '기말고사':'기말평가'})

In [16]:
grade.head()

       퀴즈  중간평가  기말평가
id
12405  86    75    87
14294  77    60    89
12060  76    53    61
10807  84    89    58
14802  76    56    44

* 퀴즈 20% 중간 30% 기말 50% 의 비중으로 성적 합계를 계산하는 것으로 가정합시다
* assign() 함수에 식을 적을 수 있습니다 .
* df['column']은 df.column과 같습니다.

In [17]:
grade = grade.assign(합계 = grade.퀴즈 * 0.2 + grade.중간평가 * 0.3 + grade.기말평가 * 0.5)

In [18]:
grade

       퀴즈  중간평가  기말평가    합계
id
12405  86    75    87  83.2
14294  77    60    89  77.9
12060  76    53    61  61.6
10807  84    89    58  72.5
14802  76    56    44  54.0
...    ..   ...   ...   ...
13034  80    77    67  72.6
13250  99    85    56  73.3
18709  94    84    90  89.0
17212  81    93    79  83.6
17195  81   100    73  82.7

[100 rows x 4 columns]

* 성적순으로 정렬해봅시다. 
* sort_values() 함수를 사용합니다. 기본값은 오름차순, 내림차순은 옵션에 ascending= False를 넣어줘야 함

In [19]:
grade_sort = grade.sort_values('합계', ascending = False)

In [20]:
grade_sort.head()

       퀴즈  중간평가  기말평가    합계
id
14333  96    85    93  91.2
19465  97    93    87  90.8
13551  93    91    89  90.4
15508  76   100    90  90.2
18709  94    84    90  89.0

* 특정 컬럼만 선택하기
* filter() 함수를 사용합니다. 입력값에 가져오고 싶은 컬럼명을 리스트 형태로 입력합니다

In [21]:
grade_final = grade_sort.filter(['기말평가','합계'])

In [22]:
grade_final.head()

       기말평가    합계
id
14333    93  91.2
19465    87  90.8
13551    89  90.4
15508    90  90.2
18709    90  89.0